Revit 2027 API
ColorFillLegend.Origin Property
 The top left corner of the color fill legend.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Origin { get; set; }
Public Property Origin As XYZ
	Get
	Set
public:
property XYZ^ Origin {
	XYZ^ get ();
	void set (XYZ^ value);
}
member Origin : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The origin is not on the view plane that this legend is placed on.
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 The origin point must be on the view plane this legend is placed on.
See Also
Reference
ColorFillLegend Class
Autodesk.Revit.DB Namespace